// pages/about/about.js
Page({

  /**
   * 页面的初始数据
   */
  data: {
    _bodyText:[
      {
        title:"开发者简介",
        content:["我是林烁，1998年生于广东揭阳",
                 "我是广东省湛江市 岭南师范学院 信息工程学院的学生",
                 "我所在班级是2017级计算机科学与技术2班",
                 "这是我的毕业作品",
                 "如有不足，敬请包容指正"]
      },
      { 
        title:"开发历程",
        content:[
                "2020-10-22 设计前端页面\"招聘信息(首页)\"",
                "2020-10-23 完善前端页面\"招聘编辑\"并着手设计\"招聘申请\"页面",
                "2020-10-24 进一步完善前端页面\"招聘信息\"和\"招聘申请\"",
                "2020-10-25 设计前端页面\"我的\"",
                "2020-10-26 进一步完善前端页面\"我的\"并完成了本页面的设计",
                "__________________________________________（考教资去了）",
                "2020-11-02 开始着手开发后端程序，完成了springboot+mongoDB的整合",
                "2020-11-03 实现前后端数据初步联调",
                "2020-11-04 初步完成\"求职信息\"、\"浏览历史\"、\"我的招聘\"页面设计，着手设计\"个人信息\"页面",
                "2020-11-05 设计开发\"个人信息\"页面",
                "__________________________________________（面试去了）",
                "2020-11-07 完善\"个人信息\"页面并与后端联通，除了\"教育经历\"、\"主修课程\"、\"校园活动\"其他都差不多了",
                "__________________________________________（吃酒席去了）",
                "2020-11-09 完成\"个人信息\"、\"我的简历\"和\"我的招聘\"所有后端处理，剩下\"浏览历史\"及\"修改招聘\"未完成",
                "2020-11-10 完成\"浏览历史\"及\"修改招聘\"的前后端对接，剩下\"搜索\"未完成",
                "2020-11-11 后台配置ssl证书，完成https请求及小程序合法校验规则"
                ]}
              ]
  },

  /**
   * 生命周期函数--监听页面加载
   */
  onLoad: function (options) {

  },

  /**
   * 生命周期函数--监听页面初次渲染完成
   */
  onReady: function () {

  },

  /**
   * 生命周期函数--监听页面显示
   */
  onShow: function () {

  },

  /**
   * 生命周期函数--监听页面隐藏
   */
  onHide: function () {

  },

  /**
   * 生命周期函数--监听页面卸载
   */
  onUnload: function () {

  },

  /**
   * 页面相关事件处理函数--监听用户下拉动作
   */
  onPullDownRefresh: function () {

  },

  /**
   * 页面上拉触底事件的处理函数
   */
  onReachBottom: function () {

  },

  /**
   * 用户点击右上角分享
   */
  onShareAppMessage: function () {

  }
})